SET NAMES UTF8;
DROP DATABASE IF EXISTS flower;
CREATE DATABASE flower CHARSET=UTF8;
USE flower;

#index.html
CREATE TABLE picture(
	pid INT PRIMARY KEY AUTO_INCREMENT,
	p_sort VARCHAR(32),#图片分类，轮播图，轮播右侧图，限时推荐，爱情鲜花图，送长辈鲜花图，永生花图，蛋糕图，礼品图
	p_src VARCHAR(128),#图片路径
	p_title VARCHAR(128),
	p_price VARCHAR(32)
);
INSERT INTO picture VALUES
#轮播图
(NULL,"banner","17_chongyangjie_pc.jpg","",""),
(NULL,"banner","17_banner_tx_pc.jpg","",""),
(NULL,"banner","longtou.jpg","",""),
#轮播右侧图
(NULL,"banner-right","rightbox_1_170829.jpg","",""),
(NULL,"banner-right","rightbox_2_170818.jpg","",""),
(NULL,"banner-right","rightbox_3_170830.jpg","",""),
#限时推荐图
(NULL,"recommend","xianshi_1_170927.jpg","",""),
(NULL,"recommend","xianshi_2_170927.jpg","",""),
(NULL,"recommend","xianshi_3_170912.jpg","",""),
#爱情鲜花图
(NULL,"love","9010011.jpg_220x240.jpg","鲜花·一心一意","126"),
(NULL,"love","9012011.jpg_220x240.jpg","鲜花·阳光海岸","218"),
(NULL,"love","9010966.jpg_220x240.jpg","鲜花·一往情深","235"),
(NULL,"love","9012042.jpg_220x240.jpg","鲜花·热恋","359"),
(NULL,"love","9010947.jpg_220x240.jpg","鲜花·真爱如初","186"),
(NULL,"love","9012177.jpg_220x240.jpg","鲜花·不变的承诺","519"),
(NULL,"love","9012009.jpg_220x240.jpg","鲜花·忘情巴黎","290"),
(NULL,"love","9012247.jpg_220x240.jpg","鲜花·幸福的约定","339"),
#送长辈鲜花图
(NULL,"elder","9010964.jpg_220x240.jpg","鲜花·天使之祈","195"),
(NULL,"elder","9010736.jpg_220x240.jpg","鲜花·感激","198"),
(NULL,"elder","9010741.jpg_220x240.jpg","鲜花·健康长久","412"),
(NULL,"elder","9012092.jpg_220x240.jpg","鲜花·母爱","148"),
(NULL,"elder","9012201.jpg_220x240.jpg","鲜花·馨情无限","236"),
(NULL,"elder","9012047.jpg_220x240.jpg","鲜花·爱的思念","186"),
(NULL,"elder","9012054.jpg_220x240.jpg","鲜花·真诚祝愿","238"),
(NULL,"elder","9010840.jpg_220x240.jpg","鲜花·爱的祝福","198"),
#永生花图
(NULL,"forever","1073151.jpg_220x240.jpg","永生花·小仙女","368"),
(NULL,"forever","1073092.jpg_220x240.jpg","永生花·恋心","288"),
(NULL,"forever","1073039.jpg_220x240.jpg","永生花·爱与祝福","198"),
(NULL,"forever","1073100.jpg_220x240.jpg","永生花·彩虹下的约定","368"),
(NULL,"forever","1073147.jpg_220x240.jpg","永生花·海洋之恋","999"),
(NULL,"forever","1073051.jpg_220x240.jpg","永生花·十二星座经典七彩·天蝎座","298"),
(NULL,"forever","1073094.jpg_220x240.jpg","永生花·忘To温暖你心","288"),
(NULL,"forever","1073091.jpg_220x240.jpg","永生花·十二星座经典红·天蝎座","268"),

#蛋糕图
(NULL,"cake","5302016.jpg_220x240.jpg","元祖蛋糕 · 田园晓美(8寸)","218"),
(NULL,"cake","5602016.jpg_220x240.jpg","幸福西饼蛋糕 · 四重奏蛋糕(约2磅)","198"),
(NULL,"cake","5142026.jpg_220x240.jpg","Mcake蛋糕 · 鲜莓印雪","298"),
(NULL,"cake","5131001.jpg_220x240.jpg","贝思客蛋糕 · PAPI PAPI熊蛋糕（1.2磅）","188"),
(NULL,"cake","5171014.jpg_220x240.jpg","INCAKE蛋糕 · 简爱（1.2磅）","189"),
(NULL,"cake","5182030.jpg_220x240.jpg","BONCAKE蛋糕 · 小幸运（8寸）","342"),
(NULL,"cake","5702045.jpg_220x240.jpg","米卡米卡蛋糕 · 为你而来 （1.5磅）","287"),
(NULL,"cake","5902060.jpg_220x240.jpg","诺心蛋糕 · 女神·冰淇淋蛋糕","298"),

#礼品图
(NULL,"gift","1061006.jpg_220x240.jpg","礼品 · 999纯金箔玫瑰+陶瓷花瓶","138"),
(NULL,"gift","1070064.jpg_220x240.jpg","礼品 · 天使之恋化妆镜永生花礼盒","368"),
(NULL,"gift","1064005.jpg_220x240.jpg","礼品 · 十八音水晶钢琴","228"),
(NULL,"gift","1065004.jpg_220x240.jpg","礼品 · 宝石旋转木马/蓝","158"),
(NULL,"gift","1071031.jpg_220x240.jpg","礼品 · 心形3D水晶内雕陪你走到老","169"),
(NULL,"gift","1060002.jpg_220x240.jpg","礼品 · 我爱你","208"),
(NULL,"gift","1060013.jpg_220x240.jpg","礼品 · 一路上有你","338"),
(NULL,"gift","1060022.jpg_220x240.jpg","礼品 · 斜口瓶花","489");


#最新评价
CREATE TABLE evaluates(
	eid INT PRIMARY KEY AUTO_INCREMENT,
	e_src VARCHAR(128),
	e_user_name VARCHAR(32),
	e_time VARCHAR(10),
	e_content VARCHAR(150)
);
INSERT INTO evaluates VALUES
(NULL,"9012219.jpg_80x87.jpg","237558*","2017-10-27","不错，挺好看，时间也准时"),
(NULL,"9012033.jpg_80x87.jpg","537558*","2017-10-27","第一次购买，很满意，花的质量也不错"),
(NULL,"9012141.jpg_80x87.jpg","837558*","2017-10-27","挺好看，时间也准时");

#最新资讯
CREATE TABLE news(
	nid INT PRIMARY KEY AUTO_INCREMENT,
	n_sort VARCHAR(64),
	n_title VARCHAR(128)
);
INSERT INTO news VALUES
#感动瞬间
(NULL,"feeling","花礼网用户故事&nbsp;|&nbsp;那些感动我们的"),
(NULL,"feeling","鲜花——见证跨越海峡的异地恋"),
(NULL,"feeling","你和恋人都是怎样确定关系的？"),
(NULL,"feeling","超感动 &nbsp;|&nbsp; 花礼网用户真情告白故事"),
(NULL,"feeling","盘点花礼用户印象中最深刻的一次亲吻"),
(NULL,"feeling","希望你永远自由自在"),
#热门资讯左边
(NULL,"last-news-left","12星座异地恋如何维持？送你一份"),
(NULL,"last-news-left","看十二生肖收花如何反应？一图看出"),
(NULL,"last-news-left","送花的含义，生活中怎么送花？"),
(NULL,"last-news-left","送女朋友鲜花，送花卡片写什么？"),
(NULL,"last-news-left","唱反调的人更容易在一起？"),
(NULL,"last-news-left","异地恋有大招，教你不分手？"),
#热门资讯右边
(NULL,"last-news-right","重阳节鲜花"),
(NULL,"last-news-right","鲜花枝数与其对应的含意"),
(NULL,"last-news-right","鲜花寓意，浪漫花语"),
(NULL,"last-news-right","通用送花祝福语-经典送花祝福语"),
(NULL,"last-news-right","送花的常识与技巧"),
(NULL,"last-news-right","女孩子都喜欢别人送鲜花吗？");


















#cake.html
CREATE TABLE cake(
	cid INT PRIMARY KEY AUTO_INCREMENT,
	c_sort VARCHAR(32),#图片分类，轮播图，轮播右侧图，限时推荐，爱情鲜花图，送长辈鲜花图，永生花图，蛋糕图，礼品图
	c_src VARCHAR(128),#图片路径
	c_title VARCHAR(128),
	c_price VARCHAR(32)
);
INSERT INTO cake VALUES
(NULL,"yuanzu","5302071.jpg_220x240.jpg","元祖蛋糕/清风有信(8寸)-元祖慕斯蛋糕","288"),
(NULL,"yuanzu","5302068.jpg_220x240.jpg","元祖蛋糕/莫尔卡夫(8寸)-元祖巧克力蛋糕","218"),
(NULL,"yuanzu","5302066.jpg_220x240.jpg","元祖蛋糕/情有独钟(8寸)-元祖鲜奶蛋糕","218"),
(NULL,"yuanzu","5302064.jpg_220x240.jpg","元祖蛋糕/黄金燕麦(8寸)-元祖鲜奶蛋糕","218"),

(NULL,"nuoxin","5901052.jpg_220x240.jpg","诺心蛋糕/你好米菲 hallo miffy（2-4人食）-慕斯蛋糕","218"),
(NULL,"nuoxin","5902028.jpg_220x240.jpg","诺心蛋糕/草莓拿破仑蛋糕（5-8人食）-拿破仑蛋糕","298"),
(NULL,"nuoxin","5902061.jpg_220x240.jpg","诺心蛋糕/天使·冰淇淋蛋糕-冰淇淋蛋糕","298"),
(NULL,"nuoxin","5902060.jpg_220x240.jpg","诺心蛋糕/女神·冰淇淋蛋糕-冰淇淋蛋糕","298"),

(NULL,"INCAKE","5172031.jpg_220x240.jpg","INCAKE蛋糕/云朵女孩（2.2磅）-乳脂蛋糕","279"),
(NULL,"INCAKE","5172030.jpg_220x240.jpg","INCAKE蛋糕/草莓物语 （2.2磅）-乳脂蛋糕","279"),
(NULL,"INCAKE","5172029.jpg_220x240.jpg","INCAKE蛋糕/无添加蔗糖 （2.2磅）-乳脂蛋糕","279"),
(NULL,"INCAKE","5172028.jpg_220x240.jpg","INCAKE蛋糕/经典奶香（2.2磅）-乳脂蛋糕","279"),

(NULL,"beisike","5132024.jpg_220x240.jpg","贝思客蛋糕/咖啡物语（2.2磅）-慕斯蛋糕","288"),
(NULL,"beisike","5131023.jpg_220x240.jpg","贝思客蛋糕/新天鹅堡情人（1.2磅）-巧克力蛋糕","188"),
(NULL,"beisike","5131020.jpg_220x240.jpg","贝思客蛋糕/冻烤燃情芝士（1.2磅）-芝士蛋糕","188"),
(NULL,"beisike","5131018.jpg_220x240.jpg","贝思客蛋糕/白色红丝绒（1.2磅）-奶油蛋糕","188"),

(NULL,"BONCAKE","5181038.jpg_220x240.jpg","BONCAKE蛋糕/小骨头（6寸）- 鲜奶蛋糕","238"),
(NULL,"BONCAKE","5181037.jpg_220x240.jpg","BONCAKE蛋糕/南瓜头（6寸）- 鲜奶蛋糕","238"),
(NULL,"BONCAKE","5181036.jpg_220x240.jpg","BONCAKE蛋糕/捣蛋鬼（6寸）- 鲜奶蛋糕","238"),
(NULL,"BONCAKE","5181030.jpg_220x240.jpg","BONCAKE蛋糕/小幸运（6寸）-戚风蛋糕","338"),

(NULL,"Mcake","5142029.jpg_220x240.jpg","Mcake蛋糕/黑森林拿破仑（8寸）-巧克力蛋糕","298"),
(NULL,"Mcake","5142028.jpg_220x240.jpg","Mcake蛋糕/小熊动物造型芝士味生日儿童生日宴会蛋糕（2磅）-芝士蛋糕","298"),
(NULL,"Mcake","5142027.jpg_220x240.jpg","Mcake蛋糕/柠.漾柠檬新鲜慕斯生日宴会蛋糕（2磅）-水果蛋糕","298"),
(NULL,"Mcake","5142026.jpg_220x240.jpg",">Mcake蛋糕/鲜莓印雪-新鲜草莓奶油拿破仑生日聚会蛋糕（2磅）水果蛋糕","298"),

(NULL,"wofuzi","5501020.jpg_220x240.jpg","窝夫小子蛋糕/巧克力椰子无糖（6寸）-窝夫小子无糖蛋糕","179"),
(NULL,"wofuzi","5501012.jpg_220x240.jpg","窝夫小子蛋糕/鲜奶水果(6寸)-窝夫小子鲜奶水果蛋糕","159"),
(NULL,"wofuzi","5502011.jpg_220x240.jpg","窝夫小子蛋糕/乖乖熊（8寸）-窝夫小子儿童蛋糕","199"),
(NULL,"wofuzi","5501010.jpg_220x240.jpg","窝夫小子蛋糕/蓝莓甜心（6寸）-窝夫小子心形鲜奶水果蛋糕","159"),

(NULL,"mikamika","5702061.jpg_220x240.jpg","米卡米卡蛋糕/天蝎座（1.5磅）-慕斯蛋糕","237"),
(NULL,"mikamika","5702053.jpg_220x240.jpg","米卡米卡蛋糕/甜言蜜语 Honeyed Words（1.5磅）-慕斯蛋糕","287"),
(NULL,"mikamika","5702052.jpg_220x240.jpg","米卡米卡蛋糕/女王大人 The Queen（1.5磅）-巧克力蛋糕","287"),
(NULL,"mikamika","5702050.jpg_220x240.jpg","米卡米卡蛋糕/意式提拉米苏 Italian Tiramisu（1.5磅）-慕斯蛋糕","287"),

(NULL,"faxini","5192003.jpg_220x240.jpg","法西妮蛋糕/法式榴莲千层蛋糕（2磅）-千层蛋糕","288"),
(NULL,"faxini","5192009.jpg_220x240.jpg","法西妮蛋糕/法式提拉米苏千层蛋糕（2磅）-千层蛋糕","288"),
(NULL,"faxini","5192008.jpg_220x240.jpg","法西妮蛋糕/原味芝士千层蛋糕（2磅）-千层蛋糕","298"),
(NULL,"faxini","5192007.jpg_220x240.jpg","法西妮蛋糕/法式香草千层蛋糕（2磅）-千层蛋糕","288"),

(NULL,"xingfuxibing","5602016.jpg_220x240.jpg","幸福西饼蛋糕/四重奏蛋糕(约2磅)-方形/巧克力/榴莲/慕斯蛋糕","208"),
(NULL,"xingfuxibing","5602015.jpg_220x240.jpg","幸福西饼蛋糕/（新款）榴芒双拼(约2磅)-双拼蛋糕","198"),
(NULL,"xingfuxibing","5602013.jpg_220x240.jpg","幸福西饼蛋糕/榴恋草莓(2磅)-双拼蛋糕","198"),
(NULL,"xingfuxibing","5605012.jpg_220x240.jpg","幸福西饼蛋糕/芒果雪沙(约6磅)-栗子水果蛋糕","348"),

(NULL,"Vcake","5112030.jpg_220x240.jpg","Vcake蛋糕/布朗尼 （1.5磅）-坚果巧克力口味","179"),
(NULL,"Vcake","5112029.jpg_220x240.jpg","Vcake蛋糕/心意（1.5磅）-白巧克力+覆盆子口味","229"),
(NULL,"Vcake","5112026.jpg_220x240.jpg","Vcake蛋糕/缤果雪慕（1.5磅）-酸奶蛋糕","199"),
(NULL,"Vcake","5112024.jpg_220x240.jpg","Vcake蛋糕/在一起（1.5磅）-香草蛋糕","199"),

(NULL,"kesongfang","5402028.jpg_220x240.jpg","可颂坊蛋糕/提拉米苏（8寸）-可颂坊芝士蛋糕","188"),
(NULL,"kesongfang","5402026.jpg_220x240.jpg","可颂坊蛋糕/抹茶蜜豆（8寸）-可颂坊酒醇茶香蛋糕","158"),
(NULL,"kesongfang","5402006.jpg_220x240.jpg","可颂坊蛋糕/卡布基诺（8寸）-可颂坊巧克力蛋糕","168"),
(NULL,"kesongfang","5402045.jpg_220x240.jpg","可颂坊蛋糕/四季恋歌（8寸）-慕斯蛋糕","258"),

(NULL,"yipinxuan","5102020.jpg_220x240.jpg","一品轩蛋糕/水果夏露多(2磅)","158"),
(NULL,"yipinxuan","5102137.jpg_220x240.jpg","一品轩蛋糕/圆梦(2磅)","158"),
(NULL,"yipinxuan","5102132.jpg_220x240.jpg","一品轩蛋糕/杏福滋味(2磅)","158"),
(NULL,"yipinxuan","5102130.jpg_220x240.jpg","一品轩蛋糕/全城热恋(2磅)","168"),

(NULL,"xinzhihe","5211012.jpg_220x240.jpg","心之和蛋糕/粉盐香草(1.8磅)-重芝士蛋糕","358"),
(NULL,"xinzhihe","5211010.jpg_220x240.jpg","心之和蛋糕/猫山王(1.8磅)-乳酪蛋糕","428"),
(NULL,"xinzhihe","5211008.jpg_220x240.jpg","心之和蛋糕/香草籽+德式超浓(1.8磅)-乳酪蛋糕","298"),
(NULL,"xinzhihe","5211007.jpg_220x240.jpg","心之和蛋糕/香草籽COOL酪(1.8磅)-乳酪蛋糕","298"),

(NULL,"quanguo","5010041.jpg_220x240.jpg","蛋糕/陪伴左右-2磅(8寸)水果蛋糕","168"),
(NULL,"quanguo","5010040.jpg_220x240.jpg","蛋糕/多彩生活-2磅(8寸)水果蛋糕","169"),
(NULL,"quanguo","5010042.jpg_220x240.jpg","蛋糕/鲜果缤纷-2磅(8寸)水果蛋糕","169"),
(NULL,"quanguo","5010023.jpg_220x240.jpg","蛋糕/生日蛋糕A-8寸(2磅)心形水果鲜奶蛋糕","149"),
(NULL,"quanguo","5010025.jpg_220x240.jpg","蛋糕/心之恋曲-2磅(8寸)鲜奶水果蛋糕","168"),
(NULL,"quanguo","5010046.jpg_220x240.jpg","蛋糕/水果盛宴-2磅(8寸)水果蛋糕","169"),
(NULL,"quanguo","5010020.jpg_220x240.jpg","蛋糕/蓝玫瑰鲜奶-8寸(2磅)心形鲜奶蛋糕","146"),
(NULL,"quanguo","5010044.jpg_220x240.jpg","蛋糕/欢声乐语-2磅(8寸)水果蛋糕","169"),
(NULL,"quanguo","5010045.jpg_220x240.jpg","蛋糕/美好回忆-2磅(8寸)水果蛋糕","169"),
(NULL,"quanguo","5010034.jpg_220x240.jpg","蛋糕/幸福时刻-8寸(2磅)心形鲜奶蛋糕","146"),
(NULL,"quanguo","5010027.jpg_220x240.jpg","蛋糕/我的心属于你-8寸(2磅)鲜奶水果蛋糕","149"),
(NULL,"quanguo","5010031.jpg_220x240.jpg","蛋糕/I LOVE YOU-8寸(2磅)心形鲜奶蛋糕","146");


#flower.html中的鲜花列表
CREATE TABLE flowerlist(
	fid INT PRIMARY KEY AUTO_INCREMENT,
	f_src VARCHAR(128),
	f_price VARCHAR(32),
	f_sale VARCHAR(32),
	f_onlinetime VARCHAR(10),
	f_title VARCHAR(128)
);
INSERT INTO flowerlist VALUES
(NULL,"9012247.jpg_220x240.jpg","339","1200","2017-11-5","鲜花/幸福的约定-苏醒玫瑰33枝、紫罗兰、银叶菊"),
(NULL,"9012246.jpg_220x240.jpg","296","1200","2017-11-5","鲜花/邻家女孩-红玫瑰33枝、红色小雏菊"),
(NULL,"9010011.jpg_220x240.jpg","126","1200","2017-11-5","鲜花/一心一意-玫瑰11枝，粉色勿忘我0.3扎"),
(NULL,"9012011.jpg_220x240.jpg","218","1200","2017-11-5","鲜花/阳光海岸-19枝香槟玫瑰"),
(NULL,"9010966.jpg_220x240.jpg","235","1200","2017-11-5","鲜花/一往情深-精品玫瑰礼盒:19枝红玫瑰，勿忘我适量"),
(NULL,"9012042.jpg_220x240.jpg","359","1200","2017-11-5","鲜花/热恋-红玫瑰50枝"),
(NULL,"9012041.jpg_220x240.jpg","359","1200","2017-11-5","鲜花/浪漫缤纷-戴安娜粉玫瑰50枝"),
(NULL,"9012175.jpg_220x240.jpg","228","1200","2017-11-5","鲜花/月光女神-白玫瑰11枝，绿色桔梗5枝，小菊3枝，白色石竹梅4枝"),
(NULL,"9010947.jpg_220x240.jpg","186","1200","2017-11-5","鲜花/真爱如初-雪山玫瑰11枝、深紫色勿忘我0.3扎"),
(NULL,"9012177.jpg_220x240.jpg","519","1200","2017-11-5","鲜花/不变的承诺-99枝红玫瑰"),
(NULL,"9012055.jpg_220x240.jpg","439","1200","2017-11-5","鲜花/不变的心-戴安娜玫瑰66枝"),
(NULL,"9012174.jpg_220x240.jpg","232","1200","2017-11-5","鲜花/晴朗-香槟玫瑰11枝，向日葵2枝，绿色桔梗5枝，绿色小菊3枝，叶上花3枝"),
(NULL,"9012150.jpg_220x240.jpg","519","1200","2017-11-5","鲜花/幸福久久-戴安娜粉玫瑰99枝，栀子叶适量"),
(NULL,"9012141.jpg_220x240.jpg","148","1200","2017-11-5","鲜花/柔情似水-香槟色玫瑰11枝，紫红色勿忘我0.3扎"),
(NULL,"9012161.jpg_220x240.jpg","198","1200","2017-11-5","鲜花/爱的诺言-红玫瑰19枝，白色腊梅2枝"),
(NULL,"9012003.jpg_220x240.jpg","368","1200","2017-11-5","鲜花/恋香-精品玫瑰礼盒:香槟玫瑰33枝，少量绿叶"),
(NULL,"9012240.jpg_220x240.jpg","466","1200","2017-11-5","鲜花/天天天晴-香槟玫瑰66枝"),
(NULL,"9012089.jpg_220x240.jpg","359","1200","2017-11-5","鲜花/爱在心头-玫瑰50枝：戴安娜粉玫瑰19枝，红玫瑰31枝"),
(NULL,"9012117.jpg_220x240.jpg","228","1200","2017-11-5","鲜花/暗香-香槟玫瑰11枝，黄玫瑰8枝，红豆3枝"),
(NULL,"9012228.jpg_220x240.jpg","196","1200","2017-11-5","鲜花/浪漫心情-红玫瑰19枝"),
(NULL,"9012238.jpg_220x240.jpg","226","1200","2017-11-5","鲜花/惊艳时光-红玫瑰19枝、绿色桔梗5枝"),
(NULL,"9010943.jpg_220x240.jpg","138","1200","2017-11-5","鲜花/黑夜之光-红色玫瑰11枝，满天星"),
(NULL,"9012112.jpg_220x240.jpg","192","1200","2017-11-5","鲜花/温柔如你-戴安娜粉玫瑰12枝，石竹梅7枝"),
(NULL,"9012223.jpg_220x240.jpg","228","1200","2017-11-5","鲜花/我只钟情你-香槟玫瑰11枝、白色小雏菊3枝"),
(NULL,"9010932.jpg_220x240.jpg","286","1200","2017-11-5","鲜花/海洋之心-白玫瑰29枝"),
(NULL,"9012113.jpg_220x240.jpg","192","1200","2017-11-5","鲜花/浪漫巴黎-红玫瑰12枝，石竹梅7枝"),
(NULL,"9010849.jpg_220x240.jpg","186","1200","2017-11-5","鲜花/缘份-11枝红玫瑰,2枝多头白香水百合"),
(NULL,"9012102.jpg_220x240.jpg","259","1200","2017-11-5","鲜花/一生期盼-紫玫瑰19枝、紫色桔梗6枝");

#love.html中的勇敢表达爱，勇敢唱出爱
CREATE TABLE love(
	lid INT PRIMARY KEY AUTO_INCREMENT,
	l_sort VARCHAR(64),
	l_src VARCHAR(128), 
	l_title VARCHAR(128),
	l_describe VARCHAR(256),
	l_singer VARCHAR(32),
	l_click_amount VARCHAR(16)
);
INSERT INTO love VALUES
#勇敢表达爱
(NULL,"express","couple1.jpg","秋风中相遇","你与我，秋风中相遇，漫步于静寂的夜下 你我，相知，相许，偶遇的邂逅 你我，情牵笃定，静静的看着，许下的愿望冉冉升起 你我，紧握，相偎，浪漫的初始，温情的邂逅 历经最初的幸福和期间的磨难，扶携蹒跚的前行 前行的路上，挽手相伴，走过岁月和变迁，一不小心就白了头 你我，情牵一世，相伴一生，相遇相知（这是我写给她的第一份情书，里面囊括了我和她所有的故事）","",""),
(NULL,"express","couple0.jpg","护她安好","如果我爱你，而你也正巧的爱我。你头发乱了时候，我会笑笑的替你拨一拨，然后，手还留恋的在你发上多待几秒。但是，如果我爱你，而你不巧的不爱我。你头发乱了，我只会轻轻的告诉你，你头发乱了喔。这大概是最纯粹的爱情观，如若相爱，便携手到老；如若错过，便护Ta安好","",""),
(NULL,"express","couple2.jpg","唯爱你","心，不断地坚定，情渐渐地深厚，时间，慢慢地沉淀感情。倾心相许的真爱，晨昏相守的举动，渴望朝暮执手。你的心，印在我的心，我的心，贴在你的心，我们便融在一起，爱情渐渐地茁长成万古长青的松树。","",""),
#勇敢唱出爱
(NULL,"sing","music_1.jpg","给我一个理由忘记","男生表白被虐了三遍……","深圳大学-周云婵","107万"),
(NULL,"sing","music_2.jpg","记得","虐心故事蕴含其中，耐心听完哦。","深圳大学－李雪萌","269万"),
(NULL,"sing","music_3.jpg","岁月神偷","曾经拼命想在想在一起一辈子的人，为什么最终比陌生人还要陌生呢？","深圳大学－吴仟仪","165万"),
(NULL,"sing","music_4.jpg","马来西亚的查某","终于带来一首快乐的歌，来自97年的曾雪雅翻唱","曾雪雅","82.6万"),
(NULL,"sing","music_5.jpg","走在冷风中","行走在冬夜的冷风中，我没说不代表我不会痛","深圳大学－吴仟仪","71.8万"),
(NULL,"sing","music_6.jpg","笑忘书","高考结束了，爱情也结束了……","江苏大学－殷俊雯","22.6"),
(NULL,"sing","music_7.jpg","365节","男生表白被虐了三遍……","曾雪雅","77.2万"),
(NULL,"sing","music_8.jpg","动物相爱感伤","因为曲风太特别，所以我把故事放到最后了。","深圳大学-周云婵","15.7万");

#forever-flower.html永生花
CREATE TABLE foreverflower(
	ffid INT PRIMARY KEY AUTO_INCREMENT,
	ff_sort VARCHAR(64),
	ff_src VARCHAR(128), 
	ff_title VARCHAR(128),
	ff_describe VARCHAR(256),
	ff_price VARCHAR(32)
);
INSERT INTO foreverflower VALUES
(NULL,"","1073039.jpg_220x240.jpg","特色永生花/爱与祝福","紫心奥斯汀玫瑰1朵，进口粉色康乃馨1枝，浅粉桃色小玫瑰2朵","198"),
(NULL,"畅销榜商品，特惠","1060002.jpg_220x240.jpg","泰国保鲜花/我爱你","不凋谢的玫瑰 红玫瑰系列 最佳送女友礼物","208"),
(NULL,"爆款特惠！","1073033.jpg_220x240.jpg","永生花/一生一世","厄瓜多尔进口永生红玫1朵，双色永生绣球","198"),
(NULL,"","1073092.jpg_220x240.jpg","特色永生花/恋心","蓝色永生玫瑰＋紫色永生玫瑰","288"),
(NULL,"泰国进口","1060022.jpg_220x240.jpg","泰国保鲜花/斜口瓶花","真空保鲜花，彩玫系列，5年不凋谢","198"),
(NULL,"特价","1073034.jpg_220x240.jpg","永生花/快乐熊","苔藓小熊1只，绿色奥斯丁玫瑰，浅粉桃色小玫瑰","489"),
(NULL,"","1073094.jpg_220x240.jpg","特色永生花/To温暖你心","苔藓小兔+粉色永生玫瑰＋粉边紫心奥斯丁","288"),
(NULL,"特色新品","1073151.jpg_220x240.jpg","永生花/小仙女","日本进口粉紫色大地永生玫瑰，奥斯丁永生玫瑰，搭配绣球等花材","368"),
(NULL,"","1073125.jpg_220x240.jpg","永生花/公主的水晶鞋·粉","进口粉色永生玫瑰1枝，小玫瑰1枝，搭配粉色白色绣球、小满天星","198"),
(NULL,"特惠价","1073136.jpg_220x240.jpg","巨型玫瑰/公主的音乐水晶球·七彩","大型水晶音乐球永生花","469"),
(NULL,"畅销款特惠","1073100.jpg_220x240.jpg","巨型玫瑰/彩虹下的约定","厄瓜多尔进口巨型彩色玫瑰+T400花的嫁纱S925银项链","368"),
(NULL,"新上市特惠价","1073137.jpg_220x240.jpg","巨型玫瑰/公主的音乐水晶球·红玫瑰","大型水晶音乐球永生花","398"),
(NULL,"","1073126.jpg_220x240.jpg","永生花/公主的水晶鞋·蓝","进口蓝色永生玫瑰1枝，康乃馨1枝，搭配小玫瑰，蓝色白色绣球、小满天星","198"),
(NULL,"","1060037.jpg_220x240.jpg","泰国保鲜花/一生所爱","进口保鲜花，三色玫瑰系列，5年不凋谢","218"),
(NULL,"新品特价","1073127.jpg_220x240.jpg","永生花/公主的水晶鞋·紫","紫色永生玫瑰1枝，紫色康乃馨1枝，搭配小玫瑰，紫色白色绣球、小满天星","198"),
(NULL,"","1073093.jpg_220x240.jpg","特色永生花/倾尽所爱","苔藓小熊＋厄瓜多尔进口红玫＋香槟色奥斯丁玫瑰＋浅粉桃色小玫瑰","288"),
(NULL,"","1073078.jpg_220x240.jpg","巨型玫瑰/十二星座经典蓝·天蝎座","蓝色永生玫瑰:厄瓜多尔进口巨型玫瑰","268"),
(NULL,"十二星座可选","1073051.jpg_220x240.jpg","巨型玫瑰/十二星座经典七彩·天蝎座","彩虹永生玫瑰:厄瓜多尔进口巨型玫瑰","298"),
(NULL,"热销款特价!","1073038.jpg_220x240.jpg","特色永生花/想念的季节","厄瓜多尔粉玫瑰1朵","198"),
(NULL,"","1073003.jpg_220x240.jpg","经典花盒/触摸","薰衣草礼盒：进口薰衣草永生花","168"),
(NULL,"","1060013.jpg_220x240.jpg","泰国保鲜花/一路上有你","真空玫瑰花，红玫瑰系列","338"),
(NULL,"韵升音乐盒+永生花","1073132.jpg_220x240.jpg","永生花/水晶贝壳音乐盒永生花","进口香槟色奥斯丁永生玫瑰1枝，浅粉桃色永生小玫瑰1枝","298"),
(NULL,"品味之选","1073120.jpg_220x240.jpg","永生花/时光的花","进口粉色玫瑰2枝 ,进口紫色玫瑰1枝","368"),
(NULL,"新上市特惠价","1073139.jpg_220x240.jpg","巨型玫瑰/公主的音乐水晶球·粉玫瑰","大型水晶音乐球永生花","398"),
(NULL,"","1073118.jpg_220x240.jpg","永生花/永恒的约定","红色进口永生玫瑰6枝，红色小玫瑰3枝","466"),
(NULL,"热销款","1073112.jpg_220x240.jpg","永生花/小公主","进口永生玫瑰＋唯爱S925银锁骨项链","489"),
(NULL,"特惠","1073111.jpg_220x240.jpg","永生花/静谧时光","进口深紫色玫瑰1枝，进口紫色玫瑰1枝，进口奥斯丁1枝，苔藓小兔1只","398"),
(NULL,"","1060011.jpg_220x240.jpg","泰国保鲜花/美丽人生","进口高档保鲜花,白玫瑰系列,生日礼物首选","469"),
(NULL,"","1060009.jpg_220x240.jpg","泰国保鲜花/幸福时光","爱情保鲜花，红玫瑰系列，5年不凋谢","558"),
(NULL,"","1070063.jpg_220x240.jpg","永生花/Hello Kitty水晶化妆镜永生花礼盒","化妆镜+永生玫瑰，送恋人妻子专属奢华系列礼盒","388"),
(NULL,"","1073128.jpg_220x240.jpg","特色永生花/幸福港湾","进口粉色玫瑰1枝，浅紫色康乃馨1枝，浅粉桃色小玫瑰1朵","268"),
(NULL,"","1073123.jpg_220x240.jpg","永生花/温情守候","进口红色永生玫瑰2枝，小红玫瑰1枝，酒红色康乃馨1枝，棉花1枝","298"),
(NULL,"","1073102.jpg_220x240.jpg","经典花盒/最相思","永生花盒：厄瓜多尔进口白玫瑰1朵，黄边紫心奥斯丁3朵","298"),
(NULL,"","1073001.jpg_220x240.jpg","经典花盒/感慕","薰衣草礼盒：进口薰衣草","198"),
(NULL,"","1060006.jpg_220x240.jpg","泰国保鲜花/纯心纯意","保鲜玫瑰花，彩玫系列","398"),
(NULL,"","1073146.jpg_220x240.jpg","永生花/一见倾心","粉色厄瓜多尔进口永生玫瑰5枝，紫色进口玫瑰4枝，粉紫色奥斯丁玫瑰4枝","1314"),
(NULL,"","1073145.jpg_220x240.jpg","永生花/一吻之间","厄瓜多尔进口红色永生玫瑰9枝，苔藓熊1只","999"),
(NULL,"送长辈礼物","1073130.jpg_220x240.jpg","永生花/爱的礼物","进口深紫色玫瑰1枝，进口豆沙粉色康乃馨3枝，进口香槟色奥斯丁玫瑰2枝","398"),
(NULL,"","1073129.jpg_220x240.jpg","永生花/温柔清浅","进口粉色玫瑰2枝，进口浅紫色康乃馨3枝，粉边紫心奥斯丁2枝","366"),
(NULL,"品位之选","1073121.jpg_220x240.jpg","永生花/印象·初夏","进口米白色玫瑰1枝，桃粉色玫瑰1枝，奥斯丁玫瑰2枝，浅粉桃色小玫瑰3枝","338"),
(NULL,"","1073119.jpg_220x240.jpg","永生花/星辰","进口永生蓝玫瑰9枝，搭配香芋紫绣球","689"),
(NULL,"","1073116.jpg_220x240.jpg","永生花/维多利亚花园","苔藓小熊1个，进口永生橘色玫瑰2枝，香槟色奥斯丁玫瑰1枝","329"),
(NULL,"特惠","1073110.jpg_220x240.jpg","永生花/爱的归属","苔藓小熊1个，进口橘色玫瑰1枝，进口奥斯丁2枝，浅粉桃小玫瑰1枝","398"),
(NULL,"","1073104.jpg_220x240.jpg","经典花盒/小清新","永生花盒：厄瓜多尔进口白玫瑰2朵，绿色奥斯丁2朵","358"),
(NULL,"","1073091.jpg_220x240.jpg","巨型玫瑰/十二星座经典红·天蝎座","红色永生玫瑰:厄瓜多尔进口巨型玫瑰","268"),
(NULL,"2017升级版,圣诞特惠","1073032.jpg_220x240.jpg","永生花/Merry熊","苔藓小熊1个，进口红色奥斯汀玫瑰1朵，浅粉色小玫瑰1朵","198"),
(NULL,"","1060060.jpg_220x240.jpg","泰国保鲜花/美好时光","半球形进口泰国保鲜花，5年不凋谢","689"),
(NULL,"升级款","1073025.jpg_220x240.jpg","经典花盒/怦然心动","永生花盒：厄瓜多尔进口红色永生玫瑰","689"),
(NULL,"","1060049.jpg_220x240.jpg","泰国保鲜花/清香如兰","进口保鲜花，清新兰花系列，清新优雅,装点家居礼物","528"),
(NULL,"","1060051.jpg_220x240.jpg","泰国保鲜花/玫瑰花园/淡雅","进口保鲜花，彩玫系列，清新优雅,生日礼品,家居礼物","786"),
(NULL,"","1060046.jpg_220x240.jpg","泰国保鲜花/玫瑰花园/红","进口保鲜花，红玫瑰9枝，不凋谢真空玫瑰花","786"),
(NULL,"","1060045.jpg_220x240.jpg","泰国保鲜花/天使的爱","荷兰工艺保鲜玫瑰，白/彩玫瑰共3朵，泰国进口","218"),
(NULL,"","1060028.jpg_220x240.jpg","泰国保鲜花/真爱玫瑰","精选绽放优美的红玫瑰5枝","459"),
(NULL,"","1060026.jpg_220x240.jpg","泰国保鲜花/心心相恋","真空玫瑰，红玫瑰系列，5年不凋","429"),
(NULL,"","1060007.jpg_220x240.jpg","泰国保鲜花/五彩生活","不凋谢玫瑰，彩玫系列，进口保鲜花","308"),
(NULL,"","1060003.jpg_220x240.jpg","泰国保鲜花/爱永恒","进口保鲜花，彩玫系列，5年不凋谢","258"),
(NULL,"2017圣诞节新品","1073155.jpg_220x240.jpg","永生花/Be my love"," 厄瓜多尔进口红色永生玫瑰1枝，进口白色永生玫瑰1枝，棉花2朵，粉色珍珠5颗","398"),
(NULL,"特价！","1070065.jpg_220x240.jpg","永生花/芭蕾舞女孩化妆镜永生花礼盒","化妆镜+永生玫瑰，送恋人妻子专属奢华系列礼盒","368"),
(NULL,"","1070064.jpg_220x240.jpg","永生花/天使之恋化妆镜永生花礼盒","化妆镜+永生玫瑰，送恋人妻子专属奢华系列礼盒","368"),
(NULL,"","1070062.jpg_220x240.jpg","永生花/女人花化妆镜永生花礼盒","化妆镜+永生玫瑰，送老师长辈专属奢华系列礼盒","368"),
(NULL,"","1070061.jpg_220x240.jpg","永生花/限量奢华爱情玫瑰化妆镜永生花礼盒","化妆镜+永生玫瑰","588"),
(NULL,"","1073147.jpg_220x240.jpg","永生花/海洋之恋","厄瓜多尔进口蓝色永生玫瑰5朵，白玫瑰5朵,浅蓝色奥斯丁4朵","999"),
(NULL,"","1073135.jpg_220x240.jpg","永生花/光阴的故事","进口橘色永生玫瑰2枝，绿色奥斯丁玫瑰1枝","298"),
(NULL,"","1073131.jpg_220x240.jpg","永生花/甜蜜恋情","厄瓜多尔进口永生红玫瑰（直径6-7cm）3枝，红色小玫瑰3枝","358"),
(NULL,"","1073117.jpg_220x240.jpg","永生花/维也纳深林","苔藓小熊1个，厄瓜多尔进口永生白色玫瑰2枝","328"),
(NULL,"","1073115.jpg_220x240.jpg","永生花/凝望星空","厄瓜多尔进口紫玫瑰1枝，蓝色玫瑰1枝，紫色玫瑰1枝","398"),
(NULL,"","1073114.jpg_220x240.jpg","永生花/深海秘境","进口永生蓝玫瑰6枝，浅粉桃色玫瑰3枝","468"),
(NULL,"","1073113.jpg_220x240.jpg","永生花/花开半夏","粉色进口永生玫瑰，搭配永生香芋紫绣球","689"),
(NULL,"","1073109.jpg_220x240.jpg","巨型玫瑰/小熊的花园","苔藓小熊1个，墨绿色进口巨型玫瑰1枝，浅粉桃色玫瑰1枝","899"),
(NULL,"圣诞特惠","1073108.jpg_220x240.jpg","永生花/森情蜜语","苔藓小熊1个，厄瓜多尔进口红色永生玫瑰1枝，进口白色奥斯汀玫瑰1朵，浅粉色小玫瑰2朵","288"),
(NULL,"特惠","1073103.jpg_220x240.jpg","经典花盒/兔子小姐","永生花盒：厄瓜多尔进口白玫瑰1朵，黄边绿心奥斯丁玫瑰2朵","298"),
(NULL,"","1073101.jpg_220x240.jpg","巨型玫瑰/粉色琉璃","红色永生玫瑰:厄瓜多尔进口巨型粉玫瑰+T400花的嫁纱S925银项链","338"),
(NULL,"","1073064.jpg_220x240.jpg","巨型玫瑰/十二星座经典粉·天蝎座","粉色永生玫瑰:厄瓜多尔进口巨型玫瑰","268"),
(NULL,"","1060064.jpg_220x240.jpg","泰国保鲜花/邂逅","万紫千红系列进口泰国保鲜花，5年不凋谢","469"),
(NULL,"","1060065.jpg_220x240.jpg","泰国保鲜花/清雅若兰","万紫千红系列进口泰国保鲜花，5年不凋谢","298"),
(NULL,"","1060063.jpg_220x240.jpg","泰国保鲜花/心若兰","万紫千红系列进口泰国保鲜花，5年不凋谢","238"),
(NULL,"","1073031.jpg_220x240.jpg","巨型玫瑰/嫩粉","粉色永生玫瑰:厄瓜多尔进口巨型玫瑰","268"),
(NULL,"","1073024.jpg_220x240.jpg","经典花盒/漫步爱琴海","永生花盒：厄瓜多尔进口蓝色永生玫瑰3枝","326"),
(NULL,"","1073023.jpg_220x240.jpg","经典花盒/佳期如梦","永生花盒：进口永生玫瑰3枝,永生康乃馨3枝","436"),
(NULL,"","1073017.jpg_220x240.jpg","永生花/一生的承诺","厄瓜多尔玫瑰进口整枝大号永生玫瑰","298"),
(NULL,"","1073016.jpg_220x240.jpg","巨型玫瑰/嫣红","红色永生玫瑰:厄瓜多尔进口巨型玫瑰","268"),
(NULL,"","1073015.jpg_220x240.jpg","巨型玫瑰/柔粉","粉色永生玫瑰,厄瓜多尔进口巨型玫瑰","268"),
(NULL,"","1073014.jpg_220x240.jpg","巨型玫瑰/黛绿","绿色永生玫瑰:厄瓜多尔进口巨型玫瑰","268"),
(NULL,"","1073011.jpg_220x240.jpg","巨型玫瑰/紫魅","紫色永生玫瑰:厄瓜多尔进口巨型玫瑰","268"),
(NULL,"","1060048.jpg_220x240.jpg","泰国保鲜花/清新如兰(小号)","进口保鲜花，清新兰花系列，清新优雅,装点家居礼物","596"),
(NULL,"","1060047.jpg_220x240.jpg","泰国保鲜花/清新如兰(大号)","进口保鲜花，清新兰花系列，清新优雅,装点家居礼物","786"),
(NULL,"","1060043.jpg_220x240.jpg","泰国保鲜花/约定","高身方口花瓶进口保鲜花，彩玫系列,不凋谢玫瑰","489"),
(NULL,"","1060039.jpg_220x240.jpg","泰国保鲜花/玫瑰之约","不凋谢的鲜花 三色玫瑰系列 进口保鲜花","498"),
(NULL,"","1060038.jpg_220x240.jpg","泰国保鲜花/爱不褪色","5年不凋谢，真空保鲜花，彩玫系列，玫瑰5枝","338"),
(NULL,"","1060035.jpg_220x240.jpg","泰国保鲜花/玫瑰情缘","不凋谢的爱情之花，彩玫系列，进口保鲜花","458"),
(NULL,"","1060029.jpg_220x240.jpg","泰国保鲜花/爱之承诺","真空鲜花，彩玫系列（5枝玫瑰），5年不凋谢","398"),
(NULL,"","1060015.jpg_220x240.jpg","泰国保鲜花/美丽无限","进口保鲜花，红玫瑰系列，5年不凋谢","278"),
(NULL,"","1060010.jpg_220x240.jpg","泰国保鲜花/优雅","真空玫瑰，彩玫七枝，5年不凋谢","548"),
(NULL,"","1060005.jpg_220x240.jpg","泰国保鲜花/玫瑰恋曲","玫瑰保鲜花，红玫瑰系列，泰国进口","468");








